{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 3,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 3,
      "pad_l" : 3,
      "top" : "conv1\/7x7_s2",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv1\/7x7_s2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 3,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "sceneImage",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "conv1\/7x7_s2",
      "pad_l" : 0,
      "name" : "pool1\/3x3_s2",
      "top" : "pool1\/3x3_s2"
    },
    {
      "alpha" : 0.0001,
      "bottom" : "pool1\/3x3_s2",
      "weights" : {

      },
      "local_size" : 5,
      "top" : "pool1\/norm1",
      "type" : "lrn",
      "name" : "pool1\/norm1",
      "beta" : 0.75
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2\/3x3_reduce",
      "blob_weights" : 7,
      "K" : 64,
      "blob_biases" : 5,
      "name" : "conv2\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "pool1\/norm1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv2\/3x3",
      "blob_weights" : 11,
      "K" : 64,
      "blob_biases" : 9,
      "name" : "conv2\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "conv2\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.0001,
      "bottom" : "conv2\/3x3",
      "weights" : {

      },
      "local_size" : 5,
      "top" : "conv2\/norm2",
      "type" : "lrn",
      "name" : "conv2\/norm2",
      "beta" : 0.75
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "conv2\/norm2",
      "pad_l" : 0,
      "name" : "pool2\/3x3_s2",
      "top" : "pool2\/3x3_s2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3a\/1x1",
      "blob_weights" : 15,
      "K" : 192,
      "blob_biases" : 13,
      "name" : "inception_3a\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "pool2\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3a\/3x3_reduce",
      "blob_weights" : 19,
      "K" : 192,
      "blob_biases" : 17,
      "name" : "inception_3a\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "pool2\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_3a\/3x3",
      "blob_weights" : 23,
      "K" : 96,
      "blob_biases" : 21,
      "name" : "inception_3a\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_3a\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3a\/5x5_reduce",
      "blob_weights" : 27,
      "K" : 192,
      "blob_biases" : 25,
      "name" : "inception_3a\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "pool2\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_3a\/5x5",
      "blob_weights" : 31,
      "K" : 16,
      "blob_biases" : 29,
      "name" : "inception_3a\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "inception_3a\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "pool2\/3x3_s2",
      "pad_l" : 1,
      "name" : "inception_3a\/pool",
      "top" : "inception_3a\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3a\/pool_proj",
      "blob_weights" : 35,
      "K" : 192,
      "blob_biases" : 33,
      "name" : "inception_3a\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "inception_3a\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_3a\/output",
      "type" : "concat",
      "name" : "inception_3a\/output",
      "bottom" : "inception_3a\/1x1,inception_3a\/3x3,inception_3a\/5x5,inception_3a\/pool_proj"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3b\/1x1",
      "blob_weights" : 39,
      "K" : 256,
      "blob_biases" : 37,
      "name" : "inception_3b\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_3a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3b\/3x3_reduce",
      "blob_weights" : 43,
      "K" : 256,
      "blob_biases" : 41,
      "name" : "inception_3b\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_3a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_3b\/3x3",
      "blob_weights" : 47,
      "K" : 128,
      "blob_biases" : 45,
      "name" : "inception_3b\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "inception_3b\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3b\/5x5_reduce",
      "blob_weights" : 51,
      "K" : 256,
      "blob_biases" : 49,
      "name" : "inception_3b\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "inception_3a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_3b\/5x5",
      "blob_weights" : 55,
      "K" : 32,
      "blob_biases" : 53,
      "name" : "inception_3b\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "inception_3b\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_3a\/output",
      "pad_l" : 1,
      "name" : "inception_3b\/pool",
      "top" : "inception_3b\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_3b\/pool_proj",
      "blob_weights" : 59,
      "K" : 256,
      "blob_biases" : 57,
      "name" : "inception_3b\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_3b\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_3b\/output",
      "type" : "concat",
      "name" : "inception_3b\/output",
      "bottom" : "inception_3b\/1x1,inception_3b\/3x3,inception_3b\/5x5,inception_3b\/pool_proj"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_3b\/output",
      "pad_l" : 0,
      "name" : "pool3\/3x3_s2",
      "top" : "pool3\/3x3_s2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4a\/1x1",
      "blob_weights" : 63,
      "K" : 480,
      "blob_biases" : 61,
      "name" : "inception_4a\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "pool3\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4a\/3x3_reduce",
      "blob_weights" : 67,
      "K" : 480,
      "blob_biases" : 65,
      "name" : "inception_4a\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "pool3\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_4a\/3x3",
      "blob_weights" : 71,
      "K" : 96,
      "blob_biases" : 69,
      "name" : "inception_4a\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 208,
      "bottom" : "inception_4a\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4a\/5x5_reduce",
      "blob_weights" : 75,
      "K" : 480,
      "blob_biases" : 73,
      "name" : "inception_4a\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "pool3\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_4a\/5x5",
      "blob_weights" : 79,
      "K" : 16,
      "blob_biases" : 77,
      "name" : "inception_4a\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "inception_4a\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "pool3\/3x3_s2",
      "pad_l" : 1,
      "name" : "inception_4a\/pool",
      "top" : "inception_4a\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4a\/pool_proj",
      "blob_weights" : 83,
      "K" : 480,
      "blob_biases" : 81,
      "name" : "inception_4a\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_4a\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_4a\/output",
      "type" : "concat",
      "name" : "inception_4a\/output",
      "bottom" : "inception_4a\/1x1,inception_4a\/3x3,inception_4a\/5x5,inception_4a\/pool_proj"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4b\/1x1",
      "blob_weights" : 87,
      "K" : 512,
      "blob_biases" : 85,
      "name" : "inception_4b\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 160,
      "bottom" : "inception_4a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4b\/3x3_reduce",
      "blob_weights" : 91,
      "K" : 512,
      "blob_biases" : 89,
      "name" : "inception_4b\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "inception_4a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_4b\/3x3",
      "blob_weights" : 95,
      "K" : 112,
      "blob_biases" : 93,
      "name" : "inception_4b\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 224,
      "bottom" : "inception_4b\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4b\/5x5_reduce",
      "blob_weights" : 99,
      "K" : 512,
      "blob_biases" : 97,
      "name" : "inception_4b\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "inception_4a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_4b\/5x5",
      "blob_weights" : 103,
      "K" : 24,
      "blob_biases" : 101,
      "name" : "inception_4b\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_4b\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_4a\/output",
      "pad_l" : 1,
      "name" : "inception_4b\/pool",
      "top" : "inception_4b\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4b\/pool_proj",
      "blob_weights" : 107,
      "K" : 512,
      "blob_biases" : 105,
      "name" : "inception_4b\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_4b\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_4b\/output",
      "type" : "concat",
      "name" : "inception_4b\/output",
      "bottom" : "inception_4b\/1x1,inception_4b\/3x3,inception_4b\/5x5,inception_4b\/pool_proj"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4c\/1x1",
      "blob_weights" : 111,
      "K" : 512,
      "blob_biases" : 109,
      "name" : "inception_4c\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_4b\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4c\/3x3_reduce",
      "blob_weights" : 115,
      "K" : 512,
      "blob_biases" : 113,
      "name" : "inception_4c\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_4b\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_4c\/3x3",
      "blob_weights" : 119,
      "K" : 128,
      "blob_biases" : 117,
      "name" : "inception_4c\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "inception_4c\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4c\/5x5_reduce",
      "blob_weights" : 123,
      "K" : 512,
      "blob_biases" : 121,
      "name" : "inception_4c\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "inception_4b\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_4c\/5x5",
      "blob_weights" : 127,
      "K" : 24,
      "blob_biases" : 125,
      "name" : "inception_4c\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_4c\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_4b\/output",
      "pad_l" : 1,
      "name" : "inception_4c\/pool",
      "top" : "inception_4c\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4c\/pool_proj",
      "blob_weights" : 131,
      "K" : 512,
      "blob_biases" : 129,
      "name" : "inception_4c\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_4c\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_4c\/output",
      "type" : "concat",
      "name" : "inception_4c\/output",
      "bottom" : "inception_4c\/1x1,inception_4c\/3x3,inception_4c\/5x5,inception_4c\/pool_proj"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4d\/1x1",
      "blob_weights" : 135,
      "K" : 512,
      "blob_biases" : 133,
      "name" : "inception_4d\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "inception_4c\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4d\/3x3_reduce",
      "blob_weights" : 139,
      "K" : 512,
      "blob_biases" : 137,
      "name" : "inception_4d\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "inception_4c\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_4d\/3x3",
      "blob_weights" : 143,
      "K" : 144,
      "blob_biases" : 141,
      "name" : "inception_4d\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "inception_4d\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4d\/5x5_reduce",
      "blob_weights" : 147,
      "K" : 512,
      "blob_biases" : 145,
      "name" : "inception_4d\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "inception_4c\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_4d\/5x5",
      "blob_weights" : 151,
      "K" : 32,
      "blob_biases" : 149,
      "name" : "inception_4d\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_4d\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_4c\/output",
      "pad_l" : 1,
      "name" : "inception_4d\/pool",
      "top" : "inception_4d\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4d\/pool_proj",
      "blob_weights" : 155,
      "K" : 512,
      "blob_biases" : 153,
      "name" : "inception_4d\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "inception_4d\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_4d\/output",
      "type" : "concat",
      "name" : "inception_4d\/output",
      "bottom" : "inception_4d\/1x1,inception_4d\/3x3,inception_4d\/5x5,inception_4d\/pool_proj"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4e\/1x1",
      "blob_weights" : 159,
      "K" : 528,
      "blob_biases" : 157,
      "name" : "inception_4e\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "inception_4d\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4e\/3x3_reduce",
      "blob_weights" : 163,
      "K" : 528,
      "blob_biases" : 161,
      "name" : "inception_4e\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 160,
      "bottom" : "inception_4d\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_4e\/3x3",
      "blob_weights" : 167,
      "K" : 160,
      "blob_biases" : 165,
      "name" : "inception_4e\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 320,
      "bottom" : "inception_4e\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4e\/5x5_reduce",
      "blob_weights" : 171,
      "K" : 528,
      "blob_biases" : 169,
      "name" : "inception_4e\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "inception_4d\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_4e\/5x5",
      "blob_weights" : 175,
      "K" : 32,
      "blob_biases" : 173,
      "name" : "inception_4e\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_4e\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_4d\/output",
      "pad_l" : 1,
      "name" : "inception_4e\/pool",
      "top" : "inception_4e\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_4e\/pool_proj",
      "blob_weights" : 179,
      "K" : 528,
      "blob_biases" : 177,
      "name" : "inception_4e\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_4e\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_4e\/output",
      "type" : "concat",
      "name" : "inception_4e\/output",
      "bottom" : "inception_4e\/1x1,inception_4e\/3x3,inception_4e\/5x5,inception_4e\/pool_proj"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_4e\/output",
      "pad_l" : 0,
      "name" : "pool4\/3x3_s2",
      "top" : "pool4\/3x3_s2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5a\/1x1",
      "blob_weights" : 183,
      "K" : 832,
      "blob_biases" : 181,
      "name" : "inception_5a\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "pool4\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5a\/3x3_reduce",
      "blob_weights" : 187,
      "K" : 832,
      "blob_biases" : 185,
      "name" : "inception_5a\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 160,
      "bottom" : "pool4\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_5a\/3x3",
      "blob_weights" : 191,
      "K" : 160,
      "blob_biases" : 189,
      "name" : "inception_5a\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 320,
      "bottom" : "inception_5a\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5a\/5x5_reduce",
      "blob_weights" : 195,
      "K" : 832,
      "blob_biases" : 193,
      "name" : "inception_5a\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "pool4\/3x3_s2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_5a\/5x5",
      "blob_weights" : 199,
      "K" : 32,
      "blob_biases" : 197,
      "name" : "inception_5a\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_5a\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "pool4\/3x3_s2",
      "pad_l" : 1,
      "name" : "inception_5a\/pool",
      "top" : "inception_5a\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5a\/pool_proj",
      "blob_weights" : 203,
      "K" : 832,
      "blob_biases" : 201,
      "name" : "inception_5a\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_5a\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_5a\/output",
      "type" : "concat",
      "name" : "inception_5a\/output",
      "bottom" : "inception_5a\/1x1,inception_5a\/3x3,inception_5a\/5x5,inception_5a\/pool_proj"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5b\/1x1",
      "blob_weights" : 207,
      "K" : 832,
      "blob_biases" : 205,
      "name" : "inception_5b\/1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "inception_5a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5b\/3x3_reduce",
      "blob_weights" : 211,
      "K" : 832,
      "blob_biases" : 209,
      "name" : "inception_5b\/3x3_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "inception_5a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "inception_5b\/3x3",
      "blob_weights" : 215,
      "K" : 192,
      "blob_biases" : 213,
      "name" : "inception_5b\/3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "inception_5b\/3x3_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5b\/5x5_reduce",
      "blob_weights" : 219,
      "K" : 832,
      "blob_biases" : 217,
      "name" : "inception_5b\/5x5_reduce",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "inception_5a\/output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "inception_5b\/5x5",
      "blob_weights" : 223,
      "K" : 48,
      "blob_biases" : 221,
      "name" : "inception_5b\/5x5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_5b\/5x5_reduce",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 1,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 1,
      "pad_b" : 1,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "inception_5a\/output",
      "pad_l" : 1,
      "name" : "inception_5b\/pool",
      "top" : "inception_5b\/pool"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "inception_5b\/pool_proj",
      "blob_weights" : 227,
      "K" : 832,
      "blob_biases" : 225,
      "name" : "inception_5b\/pool_proj",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "inception_5b\/pool",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "inception_5b\/output",
      "type" : "concat",
      "name" : "inception_5b\/output",
      "bottom" : "inception_5b\/1x1,inception_5b\/3x3,inception_5b\/5x5,inception_5b\/pool_proj"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 0,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 7,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 7,
      "pad_fill_mode" : 0,
      "bottom" : "inception_5b\/output",
      "pad_l" : 0,
      "name" : "pool5\/7x7_s1",
      "top" : "pool5\/7x7_s1"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "pool5\/7x7_s1_141_flattened",
      "type" : "flatten",
      "name" : "loss3\/classifier_preflatten",
      "bottom" : "pool5\/7x7_s1"
    },
    {
      "nB" : 1024,
      "top" : "loss3\/classifier",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 205,
      "blob_weights" : 231,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "pool5\/7x7_s1_141_flattened",
      "blob_biases" : 229,
      "has_tanh" : 0,
      "name" : "loss3\/classifier",
      "has_prelu" : 0
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "sceneLabelProbs",
      "type" : "softmax",
      "name" : "prob",
      "bottom" : "loss3\/classifier"
    }
  ]
}